---
layout: post
title: 2020年总结
date: 2021-01-13
categories: life
tags: [life]
description: 2020年总结
---

        2020年是全面建设小康社会收官战的一年，是实现第一个百年奋斗目标，
        以及向第二个百年奋斗目标迈进，承上启下的关键一年。
        按照惯例要求应该是上完腊月29当天的班才开始放假，
        因为公司做的是政府的项目，政府什么时候放假，
        我们什么时候放假，都是按照国家法定节假日走的，
        但是腊月28号下午领导说你们打扫一下卫生，可以回家过年了。
        于是，提前回家一天，其实，当时都已经感觉到新冠病毒的严重性了，
        楼上的政府领导还特意下来看一下，说是要带上口罩。在火车上，大家都戴着口罩。

        新冠病毒的快速蔓延，已经在全球范围内快速传播，老家里面走亲戚今年也都不走了。
        正常是2月10号上班，后来要求在家都要隔离14天。
        于是，就开启了远程办公。回去的时候也没有带公司的电脑，
        用的我16年买的联想的2手电脑，卡的不行不行的，键盘有些键都坏了，
        后来还特意买了一个机械键盘，本来一个问题几十分钟就可以搞定的，
        电脑不给力，只能一点一点的慢慢的修改，经常晚上修改到11点左右。
        实在受不了了，就回郑州打算用公司的电脑，当时房东还不想让回来。
        来到郑州，还要隔离14天。自己租的房子还是刚毕业那时候一个小单间，
        当时也不想住这破地方，听房东说本来这些小单间是用来装电梯的，
        大家可以想一想这迫于工作的压力也房间的面积有多大，5平米都不到，
        上个厕所还需要跑到旁边的一间公共的卫生间，年后来到郑州的隔离时候，
        每个房间都要使用封条封住，不能出去，后来给房东说了一下，没有封死，
        不然TMD上厕所怎么办。。。住在这里当时是迫于工作的压力也没有办法，
        这小单间夏天暖和，冬天凉快，不过也住习惯了，也就一直没有换。
        年后来到郑州每天吃泡面，咸菜，吃了至少两周的泡面，虽然泡面吃的够够的，
        however,现在想起来还有点十分怀念泡面的味道，哈哈。
        还好，后来公司的领导给我送来公司的电脑，华为的magicbook，
        比我这个联想的破电脑好用多了，开机很快，不到10秒，还是5秒，记不太清楚了，
        可能是当时安装的软件比较少吧。一直在宿舍远程办公到清明节前，清明节前领导才通知回公司上班。
        而且是回老公司上班，去年才政府那边的办公楼驻厂，今年因为疫情不让去那么多人了，
        就只能每天爬到6楼，而且没有电梯，办公环境还不如创业园里面的环境呢。
        老板虽然博士毕业，但是特别节俭。在宿舍办公大概1个多月，最大的改变就是自己的体重，
        穿着衣服称了一下180多斤了，真的比较吃惊。后来，下班每天走着回去，吃过晚饭继续散步，平均每天2万步，
        然后，并没有效果。于是，后来就去农业路旁边的艾特健身房锻炼了，
        由于，今年疫情的影响，各个行业冲击比较大，去健身房，锻炼了一个月，还不错，受了10斤左右，还行。
        谁知道等到第二个月去的时候，说是被会员举报到工商局，泳池不合格什么的，整治10天，
        10天后仍然没有开门，后来有人发现公司法人已经变更，之前已经辞职的会籍经理吧，专门还搞了一个群，
        会员知道老板在捣到什么鬼之后，迫不及待的就报警了，后来老板只能宣布公司倒闭了，
        有些会员买的几万的私教课也凉凉了。疫情不仅对郑州这种新一线城市冲击的大，
        老家里面也是一样，小学初恋女友，至少有15年都没有见过面了，之前在老家上班，
        5月1劳动节还专门还郑州找工作，其实我那时候已经放假回来家了。她在郑州没有逗留几天，
        也没有找到合适的工作，毕竟学历在那放着，高中没有毕业。后来，她居然跑到广州去了，
        搞起了微商，在朋友圈卖名牌鞋，衣服的那种，压力还是挺大的，还好我从她那买了一些衣服，
        给我支援了一下。后来老家邻居给介绍的一个对象，本来也是在郑州上班，年后就跑到深圳工作去了。
        聊了一段时间，感觉都不是对方的理想型，就没有继续下去。后来她里面出了事情，
        其实，我并没有因为这件事情，而选择别人去逃避她，反而，她选择了逃避。
        事情都过去了，也没有什么好说的了。其实，本来如果没有疫情的影响，打算离开郑州，去上海呢。
        郑州大街小巷，尤其是关虎屯小吃街已经吃了个遍，也没有什么值得留恋。
        疫情断断续续，就选择一直待在郑州，去年参见了2020考研，成绩不是太理想，有点不甘心。
        于是，就参加了今年的2021考研，十月一之后开始准备的，大概有60-70天左右吧，
        其实，今年的题相比较去年的题简单多了，平时做李林的六套卷和四套卷模拟题，选择题和填空题，
        大概需要两个小时，有点偏难，考试的时候其实，我一个小时就把选择，填空给做完了。
        数学考试完，上厕所抽烟的时候，碰到一个小伙也考数学，他自己都说今年能考140左右，满分150的卷子。
        就可以想想多简单了今年的数学题。然而，我对了答案之后，发现，数学的选择和填空正确率太低了，
        去年选择题还做全对了，今年改革之后选择，填空的分值还增加很多，倒是没有抓住，真的是有点可惜，
        可能平时过分关注押题的事情吧，其实，能把复习全书上面的基础知识点复习一遍，
        考个理想的成绩应该没有问题。今年的政治主观题，都是肖4上面前两套试卷的原题，
        只不过稍微换了一下问法，英语作文自己都感觉到要考什么类型的了，背的模板算是用上了，
        翻译还是往年完型填空演变过来的，不过阅读理解难度有点大。专业课806也相比较去年容易点，
        去年连一个选择题型都没有，今年还搞了几个选择题，让学生有选择的余地。
        考过之后，答案已经对过了，已经不准备复试了。

        对于，技术层面，感觉在郑州这家公司没有提高很多，记得刚来的时候老板还说试试吧，
        谁知道一试就是2年了，18年底来的。我们公司web端是用的原生的php+mssql开发的，
        框架是之前公司的一个在公司待了十几年的女程序员搞得吧，听说之前是搞pc端应用的。
        我们这边的项目没有前后端分离，也没有按照MVC框架的模式开发，
        导致好多文件都是在根目录下面，但是项目已经坐起来了，能正常使用，
        这些显得就不是很重要了。对于，一些存储过程，还有视图，基本都是APP接口，
        也是一个女程序员她来维护。今年，还是主要以修改bug，流程优化为主。
        感觉在郑州这小公司继续待下去也没有什么前途，也有些好处，
        就是离家比较近，而且周末双休，去年还能拿一些加班费，今年几乎没有安排加班，
        最近和北京的一个同学聊天，都已经月薪20K了，不过，听他说干的不爽，最近辞职了。
        但是，别人，现在会的东西确实比较多点，我们这边的公司还是在windows环境上开发，
        版本控制还是在用那个svn。如果换工作的话，还得买个新的电脑，
        我这个破联想电脑做开发是不行了，写个文章还是ok的。让我那个同学推荐了一个电脑，
        果断推荐苹果今年新出的M1芯片的电脑，是苹果公司自己设计的芯片，ARM架构和因特尔的X86架构还不一样，
        它是属于精简指令的，性能高，功耗较低，噪音也比较少，不过不支持wiindows操作系统，
        况且北上广这些公司大多还是linux环境下开发，一受刺激就没买这款电脑macbook pro 内存16G的，
        花了我11499啊。在苹果官网上买的，听说是给现生产，上周四晚上买的，现在刚发货，
        估计明天或者后天就会到了，听说最近都流行使用docker，
        还得等待我的新电脑到了才可以玩这个东西。

        其实，上面说了很多废话，但是都是个人对2020年的工作，生活方面的真情实感。
        2020年全面建设小康社会已经取得关键性成就，我们还需要对十四五规划，
        以及第二个百年奋斗目标而努力奋斗。
