---
layout: post
title: 最新IDE激活方式（所有IDE均适用）
date: 2021-08-06
categories: IDE
tags: [IDE]
description: 最新IDE激活方式（所有IDE均适用）
---

<pre>
    <code>

这俩天不知道怎么肥事，所有通过插件激活的都失效了，大多数情况都是被官方和谐了。上有对策下有政策闷！整起

目前有俩种方式来进行激活，一种为修改host文件来激活，另一种为无限30天试用变相的永久激活。

其实那来的永久，有人在打洞就有人在修复漏洞，能用多久用多久失效了在激活呗！能用多少时间。

咔咔不建议修改host文件作为激活方式，试用host激活方式会出现很多问题，如果你想使用就自寻方法哈！

下载插件：https://www.yuque.com/u30882/rx39g7/dhe52q
    <img src="./../../../../../img/zip.png">
然后将这个插件直接扔进工作区，界面就就是下图的样子
    <img src="./../../../../../img/revert1.png">
随后右下角就会出现这样的标识
    <img src="./../../../../../img/revert2.png">
点击右下角的Eval Reset会出现如下界面，将咔咔圈起来的地方打上√
    <img src="./../../../../../img/r3.png">
然后点击Reset按钮即可
    <img src="./../../../../../img/r4.png">
接着会出现如下界面，提示IDE将会重新启动，询问确定恢复设置
    <img src="./../../../../../img/r5.png">
点击确定即可，然后IDE就会重启，就可以开心的玩耍了。

今天是8/6号，激活到了9/7号，查看是否完成激活在明天就可以看到激活时间会延长一天，所有的操作都是无形之中的，不必每次操作。

从而达到无限使用的效果。
    <img src="./../../../../../img/phpstrom.png">
    </code>
</pre>

