---
layout: post
title: 从河南郑州到上海的2021年总结
date: 2022-01-08
categories: life
tags: [life]
description: 从河南郑州到上海的2021年总结
---

<pre>
    <code>
    从2019年年底新冠疫情的爆发，到至今已经有两个年头多的时间。在2020 年底，参

加了2021年全国硕士研究生考试，已经是二战解放军信息工程大学-中国人民解放军战略支

援部队信息工程大学。在河南，大多数人都觉得郑州大学是河南最好都学校，其实不然。最

好的学校应该是解放军信息大学。去年准备的时间有点晚，大概是十月一之后，白天工作，

晚上学习，为了考研，还专门买了一个ipad，总之花费的时间比较少，成绩也在情理之中，

国家线都没有过。

    其实，在2020年都有跳槽的想法，由于疫情的影响，只好继续留在了郑州。郑州的单

位双休，前公司老板还是863专家，博士后，做的一个全省都在用的项目，比较稳定。如选

择安逸，待在郑州确实不错，我们公司的领导，还给我开玩笑说，咱们这算是属于养老型的

公司。并且回家也比较方便，坐高铁不到一个小时就能到。16年毕业，就有想法来上海。

当时也比较纠结，因为已经到了奔三的年龄，还是一无所有。2021考研成绩出来之后，就开

始为跳槽作准备，在2021年还专门换了一台macbook pro m1的机器。大家都说，金三银

四是找工作的好时机。于是，在4月初，也就是清明节后，把郑州的工作辞掉。来上海之前，

和刚认识不久的一个女生，还专门说了这件事情，她还说你还是去吧，更加坚定了我这个艰

难的选择。周末买了一张从郑州到浦东机场机票就离开了曾经吃遍了郑州小吃街的城市，就

来到了上海。这一刻，从16年毕业到现在等了5年。经过了一周的疯狂面试，选择了第三天

面试的公司。公司在黄浦区人民广场附近，算是在市区，附近环境也不错。还算是比较幸

运，在这么短的时间内，能迅速入职。

    在过去的一年中，有得到有失去。能够顺利入职上海一家公司，并且稳定下来。离开郑

州的选择说对也对，说错也错。对的是，很幸运的躲过了郑州720暴雨⛈，7月底的疫情，还

有10月份的疫情，以及2022元旦后的疫情。错的是，距离家太远，缺少了对某某人的陪伴。

2021年365天下来，至少有330天都在外面，由于疫情的反复，也没有经常回老家。虽然，

曾经在她假期的时候，陪她在上海迪士尼度过了美好的时光，去上海中心大厦楼顶欣赏了美

景，今年过生日的时候，别人还出钱给买了一个apple watch手表，可是最终也没有抵挡住

距离的疏远。一年四季，相见在万福复苏的春天，走过炎热的夏日，吹过萧瑟的秋风，可是

最终没有抵挡住冬日的寒冷。真的累了，最后主动选择了退出。

    有些事情，确实勉强不得，顺其自然是我听过的最无力的话。曾经的一个咖啡店的板，

还送我一句话，有志者事竟成，当时我就笑了。Now, I only believe half.身边的朋

友好多都交了答卷，可自己到现在连笔都没有，题更不会。希望2022年，情商大幅度提高。

把人生的这套试卷给交上。打铁还是需要自身硬，技术层面也能有更好的沉淀。

本文参与了 [SegmentFault 思否征文「2021 总结」](https://segmentfault.com/a/1190000041089764)，欢迎正在阅读的你也加入。

    </code>
</pre>
