---
layout: post
title: 2022年总结
date: 2023-01-02
categories: life
tags: [life]
description: 2022年总结
---

<pre>
    <code>
   2022年最经典的总结是1月-11月做核酸，12月阳了，哈哈。

   2022年年初过年放假貌似是请了3天年假提前回家，当时的政策还是提倡就地过年，不过

最后还是回去了，还好到家之后没有集中隔离。回家被安排相亲是必须走的流程，也就见

了2个哈哈，之后就没有联系。

   假期结束之后，第一天就到公司上班了，刚到楼上，碰到了老板，没有想到的是老板在企

业微信群里面发了红包，挺大的，可惜手机打开的有点晚，没有抢到。

2月底，表妹给介绍对象，提前回家了一趟，其实异地恋真的有点难，最终还是以失

败告终。到了3月中旬，我的左邻右臂同桌，纷纷离开的公司，一个是回到了郑州，女朋友在郑

州，听说不回去闹着要分手，另外一个是跳槽去了另外一家公司。感觉他们俩和商量好似的，在

三月中旬的周五，他们俩同时办的手续，然后走了。更巧的是，当时正赶到上海疫情的暴发期，

从那之后我们一直居家办公一直到6月1号儿童节复工。本来以为清明节可以结束，后来又

等到5月1假期还是没有结束，一直持续到6月1号。3月中旬最初是每天在小区花园做

核酸，后来以楼栋为单位在楼下做核酸，当时我们这栋楼我建了一个微信群，然后就当了楼组

长，期间每天通知做抗原，做核酸，发放物资，还好算是挺过来了，我们这栋楼也没有出现问

题，后来居委还给发了一个志愿者证书，还是挺高兴的。今天夏天上海持续高温，手机有

时候都显示50多度。。然后，一转眼，到了十月一假期，发小结婚就提前回去了，没有想

到他的初中同学还有之前和我一个班级的。假期结束回来之后，又安排了一个新的项目，

持续加班到11月中旬，总算是把项目给弄上线了。这个项目换了一个产品，可能是时间赶得比

较急，原型图整的有的偷工减料的感觉，中间和他有太多的摩擦。三年了，胜利的曙光终

于到来，放开了，大家陆续的几乎都阳了。有人用四个字总结这一年：一言难尽，真的是

很经典。

   对于技术层面，从公司的技术分享的leecode上面研究了一些算法，使用laradock里面

的php集成环境，跑项目感觉还是很高大上的哈哈。中间也听过一些线下大佬的讲座，阿里巴巴

讲的k8s，还有最近tidb的技术分享，也是挺棒的，他们的办公就在外滩对面，这个确实是和

牛的，哈哈。

   2022年立下的好多flag，还没有实现，那就在2023年继续努力实现吧。

    </code>
</pre>
